ERD_mermaid.md
```mermaid
erDiagram
    Category {
        int id PK
        int parent_id FK
        varchar name UK
        varchar slug UK
        boolean is_active
        smallint level
    }

    Product {
        int id PK
        int category_id FK
        varchar name UK
        varchar slug UK
        text description
        boolean is_digital
        boolean is_active
        datetime created_at
        datetime updated_at
        decimal price
    }

    StockManagement {
        int id PK
        int product_id FK UK
        int quantity
        datetime last_checked_at
    }

    %% Relationships
    Category ||--o{ Product : "has many"
    Category ||--o{ Category : "self-referencing"
    Product ||--|| StockManagement : "has one"
```
